<template>
  <div class="about">

    <title> 사용방법 </title>


    <link href="style.css" rel="stylesheet">
    <img src="./images/오늘의 날씨.jpg" alt="오늘날씨캐릭터" width="250">
    <br>
    <br>
    <br>
    
    <h1>  개발 이유 </h1>
    <u1>
      <li> 데이트를 하기위해 외출을 하려고 한다. </li> 
      <li> 시간과 장소에 따라 날씨가 달라 기후변화에 난감한 경우가 있다.</li>
      <li> 이 데이트 계획을 통하여 기후변화로인해 난감한 일을 피하기위해 </li>
      <li> 기후변화를 체크하고 계획을 세움으로 더 행복한 데이트를 제공한다.</li>
    </u1>


    <br>
    <br>
    <br>
    <br>

    <h1>  사용 방법 </h1>
    <u1>
      <li> 데이트코스 추천에 필요한 옵션을 네비게이션 바에서 찾아 클릭한다. </li> 
      <li> 오늘 날씨, 좌표 찾기, 계획 차트, 스케쥴, 참고SNS 바를 클릭하여 해당 소제목의 내용으로 이동한다. </li>
    </u1>


    <br>
    <br>
    <br>
    <br>


    <h1>  오늘 날씨 </h1>
    <u1>
      <li>현재 원하는 장소의 날씨를 알려주어 데이트 계획을 책임진다. </li>
      <li>현재 원하는 온도를 알려주어 오늘의 룩을 책임질 수있다.</li>
    </u1>


    <br>
    <br>
    <br>
    <br>


    <h1>  좌표 찾기 </h1>
    <u1>
      <li>우선 첨부된 링크의 영상을 보고 원하는 위치의 좌표찾는 방법을 숙지한다. </li>
      <li>구글맵 혹은 카카오맵에서 원하는 위치를 검색한다.</li>
      <li>원하는 지도정보의 링크를 클릭하여 접속한다.</li>
      <li>위의 시청한 동영상을 통하여 숙지한 내용으로 좌표를 찾을 수 있다.</li>
      <li>만약 동영상의 내용이 기억이 안난다면 영상 다시보러가기 클릭 버튼을 누른다.</li>
      
    </u1>


    <br>
    <br>
    <br>
    <br>


    <h1> 계획 차트</h1>
    <u1>
      <li>가장 상단의 이동 버튼을 통해 원하는 정보만 이동하여 볼 수 있다.</li>
      <li>여행지 추가 - (코스추가)를 클릭하여 가고자 하는 사람의 정보와 여행정보들을 등록한다.</li>
      <li>사용자가 원한 데이트장소의 정보들을 저장하여 관리하고 다시 볼 수있다</li>
      <li>정보들을 등록하고 수정, 삭제의 관리버튼을 눌러 등록정보를 수정, 삭제할 수있다.</li>
      <li>등록한 정보를 바탕으로 검색을 클릭하여 해당 장소의 기후정보를 알 수 있다.</li>

      <br>
      <br>

      <h2>여행지 추가테이블로 이동</h2>
      <li>순서에는 몇 번째 여행지인지 기입</li>
      <li>사용자의 이름을 기입</li>
      <li>참고할 링크를 붙여 넣는다.</li>
      <li>여행지위도, 경도를 적어넣는다.</li>
      <li>여행지의 설명을 넣을 수 있는 메모장</li>
      <li>등록 날자와 정보를 볼 수있다.</li>

      <br>
      <h2>여행지 온도그래프로 이동</h2>
      <li>여행지의 온도를 그래프로 볼 수있다.</li>

      <br>
      <h2>여행 지도로 이동</h2>
      <li>여행지 주변의 동네를 볼 수있다.</li>

      <br>
      <h2>여행 날짜로 이동</h2>
      <li>놀러갈 날짜를 클릭하여 볼 수있다.</li>

    </u1>


    <br>
    <br>
    <br>
    <br>
    <h1> 스케쥴 </h1>
    <u1>
      <li>이번 한 달동안의 스케쥴을 체크한다. </li>
      <li>오늘 하루, 한 주, 한 달, 4일의 기준으로 원하는 스케쥴을 볼 수있다. </li>
      <li>스케쥴 체크를 통해서 데이트를 위한 이중약속에 대비할 수 있다.</li>
    </u1>
    

    <br>
    <br>
    <br>
    <br>
  
  
    <h1> 참고 SNS</h1>
    <u1>
      <li> 유명 인플루언서에게 데이트 꿀팁 정보를 얻을수 있다. </li>
      <li> 방법을 잘 숙지하여 모두 이성친구를 만들 수있다.</li>
      
      <a href="#top"> 
      <br>
      <br>
      <br>
      <br>
      상단으로 이동</a>

    </u1>
  </div>
</template>




//<p id ="top" style="margin-top: 10px">상단으로 이동</p>

